DebtManagment/src/Documents/Платеж/Платеж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Платеж</name>
  <registerRecords>AccumulationRegister.ОстаткиДолгов</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Долги</name>
    <attributes>
      <name>Плательщик</name>
      <type>
        <types>CatalogRef.Должники</types>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>CatalogRef.Долги</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DebtManagment/src/AccumulationRegisters/ОстаткиДолгов/ОстаткиДолгов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиДолгов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DebtManagment/src/Documents/Платеж/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиДолгов Расход
	Движения.ОстаткиДолгов.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.ОстаткиДолгов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Долг = ТекСтрокаДолги.Долг;
		Движение.Сумма = ТекСтрокаДолги.СуммаПлатежа;
		Движение.ДатаПлатежа = ТекСтрокаДолги.ДатаПлатежа;
		Движение.Плательщик = ТекСтрокаДолги.Плательщик;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
